In [1]:
import pandas as pd

In [2]:
tables = pd.read_html("examples/fdic_failed_bank_list.html")

In [3]:
len(tables)

1

In [4]:
failures = tables[0]

In [5]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [6]:
close_timetamps = pd.to_datetime(failures["Closing Date"])

In [7]:
close_timetamps

0     2016-09-23
1     2016-08-19
2     2016-05-06
3     2016-04-29
4     2016-03-11
         ...
542   2001-07-27
543   2001-05-03
544   2001-02-02
545   2000-12-14
546   2000-10-13
Name: Closing Date, Length: 547, dtype: datetime64[ns]

In [8]:
close_timetamps.dt.year.value_counts()

Closing Date
2010    157
2009    140
2011     92
2012     51
2008     25
2013     24
2014     18
2002     11
2015      8
2016      5
2004      4
2001      4
2007      3
2003      3
2000      2
Name: count, dtype: int64

In [9]:
from lxml import objectify

In [10]:
path = "D:/xiazai/pydata-book-3rd-edition/datasets/mta_perf/Performance_MNR.xml"

In [11]:
with open(path) as f:
    parsed = objectify.parse(f)

In [12]:
root = parsed.getroot()

In [13]:
data = []

In [14]:
skip_fields = ["PARENT_SEQ", "INDICATOR_SEQ",
               "DESIRED_CHANGE", "DECIMAL_PLACES"]

In [15]:
for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [16]:
perf = pd.DataFrame(data)

In [17]:
perf.head()

,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,INDICATOR_UNIT,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,%,95.0,96.9,95.0,96.9
1,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,%,95.0,96.0,95.0,95.0
2,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,3,Service Indicators,M,%,95.0,96.3,95.0,96.9
3,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,4,Service Indicators,M,%,95.0,96.8,95.0,98.3
4,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,5,Service Indicators,M,%,95.0,96.6,95.0,95.8

In [18]:
perf2 = pd.read_xml(path)

In [19]:
perf2.head()

,INDICATOR_SEQ,PARENT_SEQ,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,DESIRED_CHANGE,INDICATOR_UNIT,DECIMAL_PLACES,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,U,%,1,95.00,96.90,95.00,96.90
1,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,U,%,1,95.00,96.00,95.00,95.00
2,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,3,Service Indicators,M,U,%,1,95.00,96.30,95.00,96.90
3,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,4,Service Indicators,M,U,%,1,95.00,96.80,95.00,98.30
4,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,5,Service Indicators,M,U,%,1,95.00,96.60,95.00,95.80

In [20]:
frame = pd.read_csv("examples/ex1.csv")

In [21]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [22]:
frame.to_pickle("examples/frame_pickle")

In [23]:
pd.read_pickle("examples/frame_pickle")

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [24]:
xlsx = pd.ExcelFile("examples/ex1.xlsx")

In [25]:
xlsx.sheet_names

['Sheet1']

In [26]:
xlsx.parse(sheet_name="Sheet1")

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [27]:
xlsx.parse(sheet_name="Sheet1", index_col=0)

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [28]:
frame = pd.read_excel("examples/ex1.xlsx", sheet_name="Sheet1")

In [29]:
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [30]:
writer = pd.ExcelWriter("examples/ex2.xlsx")

In [31]:
frame.to_excel(writer, sheet_name = "Sheet1")

In [32]:
writer.close()

In [33]:
import numpy as np

In [34]:
frame = pd.DataFrame({"a": np.random.standard_normal(100)})

In [35]:
frame

           a
0   0.556274
1   0.306765
2   2.006118
3   0.651293
4  -0.605380
..       ...
95 -1.182143
96  1.572526
97  1.076511
98 -1.564241
99  0.353055

[100 rows x 1 columns]

In [36]:
store = pd.HDFStore("examples/mydata.h5")

In [37]:
store["obj1"]

           a
0  -1.104334
1  -0.868295
2   0.792710
3   1.104455
4   0.383971
..       ...
95 -2.565717
96 -1.884575
97  1.040679
98 -1.128799
99 -0.761060

[100 rows x 1 columns]

In [38]:
store["obj1"] = frame

In [39]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: examples/mydata.h5

In [40]:
store["obj1_col"] = frame["a"]

In [41]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: examples/mydata.h5

In [42]:
store["obj1"]

           a
0   0.556274
1   0.306765
2   2.006118
3   0.651293
4  -0.605380
..       ...
95 -1.182143
96  1.572526
97  1.076511
98 -1.564241
99  0.353055

[100 rows x 1 columns]

In [43]:
frame

           a
0   0.556274
1   0.306765
2   2.006118
3   0.651293
4  -0.605380
..       ...
95 -1.182143
96  1.572526
97  1.076511
98 -1.564241
99  0.353055

[100 rows x 1 columns]

In [44]:
store.put("obj2", frame, format="table")

In [45]:
store.select("obj2", where=["index >= 10 and index <= 15"])

           a
10 -0.951501
11  0.909942
12 -0.652789
13  1.079049
14  0.336571
15  0.120123

In [49]:
store.close()

In [50]:
frame.to_hdf("examples/mydata.h5", key="obj3", format="table")

In [51]:
pd.read_hdf("examples/mydata.h5", key="obj3", where=["index < 5"])

          a
0  0.556274
1  0.306765
2  2.006118
3  0.651293
4 -0.605380

In [52]:
import os

In [54]:
os.remove("examples/mydata.h5")